In [1]:
import pandas as pd

Function to create a dataframe from a list of lists

In [30]:
def createDataframe(student_data: list[list[int]]) -> pd.DataFrame:
    return pd.DataFrame(student_data, columns=['student_id', 'age','name'])

In [25]:
x = createDataframe([
    [1001, 24.5, "a"],
    [1002, 22, "b"],
    [1003, 22, "c"],
    [1004, 21, None],
])
x

   student_id   age  name
0        1001  24.5     a
1        1002  22.0     b
2        1003  22.0     c
3        1004  21.0  None

Count of rows and columns in the dataframe

In [13]:
x.shape

(3, 3)

The first 3 element in the dataframe

In [13]:
x.head(3)

   student_id  age name
0        1001   24    a
1        1002   25    b
2        1003   22    c

Write a solution to select the name and age of the student with student_id = 101.

In [14]:
student = x.loc[x['student_id'] == 1001, ['name', 'age']]
print(student)

  name  age
0    a   24

Write a solution to create a new column ["Bonus"] that contains the double values of the column "salary"

In [6]:
x['age_duplicated'] = x['age'] * 2
x

   student_id  age name  age_duplicated
0        1001   24    a              48
1        1002   25    b              50
2        1003   22    c              44

Write a solution to remove these duplicate rows and keep only the first occurrence.

In [15]:
x.drop_duplicates(subset=['age'], inplace=True)
x

   student_id  age name
0        1001   24    a

Write a solution to remove the rows with missing values.

In [17]:
x.dropna(subset=['name'], inplace=True)
x

   student_id  age name
0        1001   24    a
1        1002   22    b
2        1003   22    c

Write a solution to rename the columns

In [ ]:
x.rename(columns={'name': 'id_name'}, inplace=True)

The age column is stored as floats, convert it to integers.

In [28]:
x = x.astype({'age': 'int32'})

In [31]:
x

   student_id   age  name
0        1001  24.0     a
1        1002  22.0     b
2        1003  22.0     c
3        1004  21.0  None

Write a solution to fill in the missing value as 0 in the name column.

In [34]:
x['name'].fillna('-', inplace=True)
x

   student_id   age name
0        1001  24.0    a
1        1002  22.0    b
2        1003  22.0    c
3        1004  21.0    -

Write a solution to concatenate these two DataFrames vertically into one DataFrame.

In [43]:
# Supongamos que tienes dos DataFrames llamados df1 y df2
# con la misma cantidad de columnas
# Generate df1
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

# Generate df2
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})

# Concatenar los DataFrames por filas (axis=0)
df_concatenado = pd.concat([df1, df2], axis=0)

# Si quieres resetear los Ã­ndices del DataFrame resultante
df_concatenado2 = df_concatenado.reset_index(drop=True)

# Si quieres concatenar los DataFrames por columnas (axis=1)
df_concatenado3 = pd.concat([df1, df2], axis=1)

In [46]:
df_concatenado2

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12